<a href="https://colab.research.google.com/github/Shikhas/Data-Preparation-and-Analysis/blob/master/Analyze_Occupation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd

In [11]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [12]:
users = pd.read_csv(url, sep='|', index_col = "user_id")
users.head(5) # first 5

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [13]:
users.tail(5) # last 5 entries

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [14]:
users.shape # number of rows and columns

(943, 4)

In [15]:
users.shape[0] # number of rows

943

In [16]:
users.shape[1] # number of columns

4

In [17]:
users.index # how the data is indexed

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [18]:
users.dtypes # data types of columns

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [19]:
users.occupation # print only occupation column

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [20]:
users["occupation"] # print only occupation column

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [21]:
users.occupation.value_counts().count() # number of differnt types of occupation

21

In [22]:
most_popular_occupation = users.occupation.value_counts().sort_values(ascending = False) # most popular or frequent occupation

In [23]:
most_popular_occupation.head(1)

student    196
Name: occupation, dtype: int64

In [24]:
users.occupation.value_counts().head(1).index[0] # most popular or frequent occupation

'student'

In [25]:
users.occupation.value_counts().head() # top 5

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

In [26]:
users.describe() # summarize dataframe

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [27]:
users.describe(include = "all") # describe all columns, by default only numeric ones are returned

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [28]:
users.occupation.describe() # summarize only occupation

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [29]:
round(users.age.mean()) # mean age of users

34

In [30]:
users.age.value_counts().sort_values(ascending = True).index[0] # least frequent age of users

7

In [31]:
users.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

In [32]:
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [34]:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [35]:
# mean age per occupation 
users.groupby("occupation").age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [36]:
# for each occupation, min and max age 
users.groupby("occupation").age.agg(["min","max"])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

In [38]:
# mean age of each combination of occupation and gender
users.groupby(["occupation","gender"]).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [39]:
# percent of male ratio per occupation from max to min 

def gender_to_numeric(x):
  if x == "M":
    return 1
  else:
    return 0

users["gender_n"] = users.gender.apply(gender_to_numeric)

In [40]:
users.head(5)

         age gender  occupation zip_code  gender_n
user_id
1         24      M  technician    85711         1
2         53      F       other    94043         0
3         23      M      writer    32067         1
4         24      M  technician    43537         1
5         33      F       other    15213         0

In [42]:
male_percent = users.groupby("occupation").gender_n.sum()/users.occupation.value_counts()*100
male_percent.sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

In [44]:
# for each occupation, percentage of men and women

gender_occ = users.groupby(["occupation","gender"]).agg({'gender':'count'}) # combine gender and occupation, find each count

occup_count = users.groupby("occupation").agg("count") # count for each occupation

gender_percent = gender_occ.div(occup_count, level = "occupation")*100

gender_percent.gender # all rows for gender column
# gender_percent.loc[:, "gender"]

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64